-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2024-06-13 10:13:29
-- サーバのバージョン： 10.4.32-MariaDB
-- PHP のバージョン: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `joblisting`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `job`
--

CREATE TABLE `job` (
  `id` int(11) NOT NULL,
  `店名` varchar(100) NOT NULL,
  `キャッチコピー` varchar(100) NOT NULL,
  `職種` varchar(100) NOT NULL,
  `最寄り駅` varchar(100) NOT NULL,
  `時給` int(11) NOT NULL,
  `flag` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `job`
--

INSERT INTO `job` (`id`, `店名`, `キャッチコピー`, `職種`, `最寄り駅`, `時給`, `flag`) VALUES
(1, '', '', '', '', 0, 2),
(2, 'GU', '初心者活躍中', 'アパレル', '神田', 1200, 2),
(3, '', '', '', '', 0, 2),
(4, '温泉', '従業員は温泉無料！', 'レジャー', '内幸町', 1250, 2),
(5, '龍泉寺の湯', '従業員は温泉無料！', 'レジャー', '八王子みなみ野', 1250, 1),
(6, '温泉', '従業員は温泉無料！', 'レジャー', '内幸町', 1250, 2),
(7, '', '', '', '', 0, 2),
(8, '', '', '', '', 0, 2),
(9, '', '', '', '', 0, 2),
(10, '', '', '', '', 0, 2),
(11, 'セブンイレブン', '深夜時間帯募集中', '販売', '日比谷', 1400, 1),
(12, '東進', '短時間勤務', '塾講師', '霞が関', 1800, 0),
(13, '', '', '', '', 0, 2),
(14, 'GU', '初心者活躍中', 'アパレル', '神田', 1200, 1),
(15, '居酒屋', 'まかない無料', '飲食店', '東京', 1150, 2),
(16, '居酒屋', 'まかない無料', '飲食店', '東京', 1150, 2),
(17, '居酒屋', 'まかない無料', '飲食店', '東京', 1150, 2),
(18, '居酒屋', 'まかない無料', '飲食店', '東京', 1150, 2),
(19, '', '', '', '', 0, 2),
(20, '', '', '', '', 0, 2),
(21, '', '', '', '', 0, 2),
(22, '', '', '', '', 0, 2),
(23, '', '', '', '', 0, 2),
(24, 'タリーズコーヒー', '週2~OK', '飲食店', '大手町', 1250, 0),
(25, 'ファミリーマート', '大学生歓迎', '販売', '渋谷', 1100, 0),
(26, 'ローソン', '週2日～OK', '販売', '新橋', 1150, 0),
(27, '', '', '', '', 0, 2),
(28, '', '', '', '', 0, 2),
(29, 'スターバックスコーヒー', '大学生歓迎', '飲食店', '内幸町', 1200, 0),
(30, 'ドトールコーヒー', 'まかないあり', '飲食店', '日比谷', 1200, 0),
(31, 'ユニクロ', '主婦・主夫歓迎', 'アパレル', '新宿', 1150, 0),
(32, '河合塾', '固定シフト制', '塾講師', '町田', 1750, 0),
(33, 'よみうりランド', '夏限定プール監視員', 'レジャー', 'よみうりランド', 1200, 0),
(34, 'イオンシネマ', '映画好き歓迎', '-----', '多摩センター', 1150, 2),
(35, 'イオンシネマ', '映画好き歓迎', '', '多摩センター', 1150, 2),
(36, 'イオンシネマ', '映画好き歓迎', '', '多摩センター', 1150, 2),
(37, 'イオンシネマ', '映画好き歓迎', 'レジャー', '多摩センター', 1150, 0);

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `job`
--
ALTER TABLE `job`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `job`
--
ALTER TABLE `job`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
